In [1]:
import pandas as pd
import pymysql
 
# Sukuriam prisijungimą su pymysql
connection = pymysql.connect(
    host="localhost",
    user="root",
    password="GetSober2025",
    database="sakila"
)
 
# Teisinga SQL užklausa
query = "SELECT * FROM actor a LEFT JOIN film_actor fa ON fa.actor_id = a.actor_id"
 
# Nuskaitymas į pandas DataFrame
df = pd.read_sql(query, connection)
 
# Spausdinam rezultatą
print(df)
 
# Nepamirštam uždaryti connection
#connection.close()

C:\Users\donat\AppData\Local\Temp\ipykernel_20084\3777492487.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, connection)

      actor_id first_name last_name         last_update  actor_id  film_id  \
0            1   PENELOPE   GUINESS 2006-02-15 04:34:33         1        1
1            1   PENELOPE   GUINESS 2006-02-15 04:34:33         1       23
2            1   PENELOPE   GUINESS 2006-02-15 04:34:33         1       25
3            1   PENELOPE   GUINESS 2006-02-15 04:34:33         1      106
4            1   PENELOPE   GUINESS 2006-02-15 04:34:33         1      140
...        ...        ...       ...                 ...       ...      ...
5457       200      THORA    TEMPLE 2006-02-15 04:34:33       200      879
5458       200      THORA    TEMPLE 2006-02-15 04:34:33       200      912
5459       200      THORA    TEMPLE 2006-02-15 04:34:33       200      945
5460       200      THORA    TEMPLE 2006-02-15 04:34:33       200      958
5461       200      THORA    TEMPLE 2006-02-15 04:34:33       200      993

             last_update
0    2006-02-15 05:05:03
1    2006-02-15 05:05:03
2    2006-02-15 05:05:03
3    2006-02-15 05:05:03
4    2006-02-15 05:05:03
...                  ...
5457 2006-02-15 05:05:03
5458 2006-02-15 05:05:03
5459 2006-02-15 05:05:03
5460 2006-02-15 05:05:03
5461 2006-02-15 05:05:03

[5462 rows x 7 columns]

In [2]:
# Užklausa, kuri grąžina top 10 filmų pagal nuomos kiekį
query = '''
SELECT f.film_id, f.title, COUNT(r.rental_id) AS rental_count
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.film_id, f.title
ORDER BY rental_count DESC
LIMIT 10
'''
 
top_films = pd.read_sql(query, connection)
top_films

C:\Users\donat\AppData\Local\Temp\ipykernel_20084\1158326267.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  top_films = pd.read_sql(query, connection)

   film_id                title  rental_count
0      103   BUCKET BROTHERHOOD            34
1      738     ROCKETEER MOTHER            33
2      730  RIDGEMONT SUBMARINE            32
3      382       GRIT CLOCKWORK            32
4      767        SCALAWAG DUCK            32
5      489       JUGGLER HARDLY            32
6      331       FORWARD TEMPLE            32
7      418         HOBBIT ALIEN            31
8      735         ROBBERS JOON            31
9     1000            ZORRO ARK            31

In [3]:
# Paimame film_actor ir actor lenteles
film_actor = pd.read_sql("SELECT * FROM film_actor", connection)
actor = pd.read_sql("SELECT * FROM actor", connection)
 
# Sujungiame film_actor su actor
film_actor_full = film_actor.merge(actor, on="actor_id", how="left")
 
# Sujungiame su top_films
top_film_actors = top_films.merge(film_actor_full, on="film_id", how="left")
 
# Parodome rezultatus
top_film_actors[["title", "first_name", "last_name"]].head(20)

C:\Users\donat\AppData\Local\Temp\ipykernel_20084\2289690237.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  film_actor = pd.read_sql("SELECT * FROM film_actor", connection)
C:\Users\donat\AppData\Local\Temp\ipykernel_20084\2289690237.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  actor = pd.read_sql("SELECT * FROM actor", connection)

                  title first_name     last_name
0    BUCKET BROTHERHOOD        RIP      CRAWFORD
1    BUCKET BROTHERHOOD        TIM       HACKMAN
2    BUCKET BROTHERHOOD       GARY       PHOENIX
3    BUCKET BROTHERHOOD   CHARLIZE         DENCH
4    BUCKET BROTHERHOOD    KIRSTEN        AKROYD
5    BUCKET BROTHERHOOD       BURT        TEMPLE
6      ROCKETEER MOTHER       JUDY          DEAN
7      ROCKETEER MOTHER        TOM       MIRANDA
8      ROCKETEER MOTHER      CHRIS       BRIDGES
9      ROCKETEER MOTHER      RENEE         TRACY
10     ROCKETEER MOTHER     WARREN       JACKMAN
11     ROCKETEER MOTHER      MERYL         ALLEN
12     ROCKETEER MOTHER      JAYNE   SILVERSTONE
13  RIDGEMONT SUBMARINE     JOHNNY  LOLLOBRIGIDA
14  RIDGEMONT SUBMARINE   JULIANNE         DENCH
15  RIDGEMONT SUBMARINE     WHOOPI          HURT
16  RIDGEMONT SUBMARINE    MICHAEL        BOLGER
17  RIDGEMONT SUBMARINE      JULIA       FAWCETT
18       GRIT CLOCKWORK    CAMERON     ZELLWEGER
19       GRIT CLOCKWORK      KEVIN       GARLAND

In [5]:
# Parodome rezultatus
top_film_actors[["title", "first_name", "last_name"]].tail(20)

             title first_name  last_name
34  JUGGLER HARDLY         ED    GUINESS
35  FORWARD TEMPLE        RIP    WINSLET
36  FORWARD TEMPLE       SEAN   WILLIAMS
37  FORWARD TEMPLE       GREG    CHAPLIN
38    HOBBIT ALIEN     VIVIEN     BERGEN
39    HOBBIT ALIEN      ELVIS       MARX
40    HOBBIT ALIEN     DUSTIN     TAUTOU
41    HOBBIT ALIEN     WALTER       TORN
42    HOBBIT ALIEN     WARREN    JACKMAN
43    HOBBIT ALIEN      DARYL   CRAWFORD
44    HOBBIT ALIEN      LAURA      BRODY
45    HOBBIT ALIEN      REESE       WEST
46    ROBBERS JOON      MILLA       PECK
47    ROBBERS JOON     ANGELA     HUDSON
48    ROBBERS JOON    MATTHEW      LEIGH
49    ROBBERS JOON       CUBA      ALLEN
50    ROBBERS JOON       JADA      RYDER
51       ZORRO ARK        IAN      TANDY
52       ZORRO ARK       NICK  DEGENERES
53       ZORRO ARK       LISA     MONROE

In [6]:
top_film_actors.info

<bound method DataFrame.info of     film_id                title  rental_count  actor_id       last_update_x  \
0       103   BUCKET BROTHERHOOD            34        26 2006-02-15 05:05:03
1       103   BUCKET BROTHERHOOD            34        32 2006-02-15 05:05:03
2       103   BUCKET BROTHERHOOD            34        51 2006-02-15 05:05:03
3       103   BUCKET BROTHERHOOD            34        89 2006-02-15 05:05:03
4       103   BUCKET BROTHERHOOD            34        92 2006-02-15 05:05:03
5       103   BUCKET BROTHERHOOD            34       193 2006-02-15 05:05:03
6       738     ROCKETEER MOTHER            33        35 2006-02-15 05:05:03
7       738     ROCKETEER MOTHER            33        42 2006-02-15 05:05:03
8       738     ROCKETEER MOTHER            33        98 2006-02-15 05:05:03
9       738     ROCKETEER MOTHER            33       117 2006-02-15 05:05:03
10      738     ROCKETEER MOTHER            33       119 2006-02-15 05:05:03
11      738     ROCKETEER MOTHER            33       194 2006-02-15 05:05:03
12      738     ROCKETEER MOTHER            33       195 2006-02-15 05:05:03
13      730  RIDGEMONT SUBMARINE            32         5 2006-02-15 05:05:03
14      730  RIDGEMONT SUBMARINE            32       123 2006-02-15 05:05:03
15      730  RIDGEMONT SUBMARINE            32       140 2006-02-15 05:05:03
16      730  RIDGEMONT SUBMARINE            32       185 2006-02-15 05:05:03
17      730  RIDGEMONT SUBMARINE            32       199 2006-02-15 05:05:03
18      382       GRIT CLOCKWORK            32       111 2006-02-15 05:05:03
19      382       GRIT CLOCKWORK            32       127 2006-02-15 05:05:03
20      382       GRIT CLOCKWORK            32       151 2006-02-15 05:05:03
21      767        SCALAWAG DUCK            32        45 2006-02-15 05:05:03
22      767        SCALAWAG DUCK            32        57 2006-02-15 05:05:03
23      767        SCALAWAG DUCK            32        61 2006-02-15 05:05:03
24      767        SCALAWAG DUCK            32        78 2006-02-15 05:05:03
25      767        SCALAWAG DUCK            32       160 2006-02-15 05:05:03
26      489       JUGGLER HARDLY            32        33 2006-02-15 05:05:03
27      489       JUGGLER HARDLY            32        54 2006-02-15 05:05:03
28      489       JUGGLER HARDLY            32       111 2006-02-15 05:05:03
29      489       JUGGLER HARDLY            32       120 2006-02-15 05:05:03
30      489       JUGGLER HARDLY            32       122 2006-02-15 05:05:03
31      489       JUGGLER HARDLY            32       137 2006-02-15 05:05:03
32      489       JUGGLER HARDLY            32       139 2006-02-15 05:05:03
33      489       JUGGLER HARDLY            32       154 2006-02-15 05:05:03
34      489       JUGGLER HARDLY            32       179 2006-02-15 05:05:03
35      331       FORWARD TEMPLE            32        68 2006-02-15 05:05:03
36      331       FORWARD TEMPLE            32        72 2006-02-15 05:05:03
37      331       FORWARD TEMPLE            32        86 2006-02-15 05:05:03
38      418         HOBBIT ALIEN            31        14 2006-02-15 05:05:03
39      418         HOBBIT ALIEN            31        22 2006-02-15 05:05:03
40      418         HOBBIT ALIEN            31        59 2006-02-15 05:05:03
41      418         HOBBIT ALIEN            31       102 2006-02-15 05:05:03
42      418         HOBBIT ALIEN            31       119 2006-02-15 05:05:03
43      418         HOBBIT ALIEN            31       129 2006-02-15 05:05:03
44      418         HOBBIT ALIEN            31       159 2006-02-15 05:05:03
45      418         HOBBIT ALIEN            31       197 2006-02-15 05:05:03
46      735         ROBBERS JOON            31        33 2006-02-15 05:05:03
47      735         ROBBERS JOON            31        65 2006-02-15 05:05:03
48      735         ROBBERS JOON            31       103 2006-02-15 05:05:03
49      735         ROBBERS JOON            31       118 2006-02-15 05:05:03
50      735         ROBBERS JOON            31       142 2006-02-15 05:05:03
51     1000            ZORRO ARK            31       155 2006-02-15 05:05:03
52     1000            ZORRO ARK            31       166 2006-02-15 05:05:03
53     1000            ZORRO ARK            31       178 2006-02-15 05:05:03

   first_name     last_name       last_update_y
0         RIP      CRAWFORD 2006-02-15 04:34:33
1         TIM       HACKMAN 2006-02-15 04:34:33
2        GARY       PHOENIX 2006-02-15 04:34:33
3    CHARLIZE         DENCH 2006-02-15 04:34:33
4     KIRSTEN        AKROYD 2006-02-15 04:34:33
5        BURT        TEMPLE 2006-02-15 04:34:33
6        JUDY          DEAN 2006-02-15 04:34:33
7         TOM       MIRANDA 2006-02-15 04:34:33
8       CHRIS       BRIDGES 2006-02-15 04:34:33
9       RENEE         TRACY 2006-02-15 04:34:33
10     WARREN       JACKMAN 2006-02-15 04:34:33
11      MERYL         ALLEN 2006-02-15 04:34:33
12      JAYNE   SILVERSTONE 2006-02-15 04:34:33
13     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
14   JULIANNE         DENCH 2006-02-15 04:34:33
15     WHOOPI          HURT 2006-02-15 04:34:33
16    MICHAEL        BOLGER 2006-02-15 04:34:33
17      JULIA       FAWCETT 2006-02-15 04:34:33
18    CAMERON     ZELLWEGER 2006-02-15 04:34:33
19      KEVIN       GARLAND 2006-02-15 04:34:33
20   GEOFFREY        HESTON 2006-02-15 04:34:33
21      REESE        KILMER 2006-02-15 04:34:33
22       JUDE        CRUISE 2006-02-15 04:34:33
23  CHRISTIAN        NEESON 2006-02-15 04:34:33
24    GROUCHO       SINATRA 2006-02-15 04:34:33
25      CHRIS          DEPP 2006-02-15 04:34:33
26      MILLA          PECK 2006-02-15 04:34:33
27   PENELOPE       PINKETT 2006-02-15 04:34:33
28    CAMERON     ZELLWEGER 2006-02-15 04:34:33
29   PENELOPE        MONROE 2006-02-15 04:34:33
30      SALMA         NOLTE 2006-02-15 04:34:33
31     MORGAN      WILLIAMS 2006-02-15 04:34:33
32       EWAN       GOODING 2006-02-15 04:34:33
33      MERYL        GIBSON 2006-02-15 04:34:33
34         ED       GUINESS 2006-02-15 04:34:33
35        RIP       WINSLET 2006-02-15 04:34:33
36       SEAN      WILLIAMS 2006-02-15 04:34:33
37       GREG       CHAPLIN 2006-02-15 04:34:33
38     VIVIEN        BERGEN 2006-02-15 04:34:33
39      ELVIS          MARX 2006-02-15 04:34:33
40     DUSTIN        TAUTOU 2006-02-15 04:34:33
41     WALTER          TORN 2006-02-15 04:34:33
42     WARREN       JACKMAN 2006-02-15 04:34:33
43      DARYL      CRAWFORD 2006-02-15 04:34:33
44      LAURA         BRODY 2006-02-15 04:34:33
45      REESE          WEST 2006-02-15 04:34:33
46      MILLA          PECK 2006-02-15 04:34:33
47     ANGELA        HUDSON 2006-02-15 04:34:33
48    MATTHEW         LEIGH 2006-02-15 04:34:33
49       CUBA         ALLEN 2006-02-15 04:34:33
50       JADA         RYDER 2006-02-15 04:34:33
51        IAN         TANDY 2006-02-15 04:34:33
52       NICK     DEGENERES 2006-02-15 04:34:33
53       LISA        MONROE 2006-02-15 04:34:33  >

In [7]:
# Užklausos
customers_df = pd.read_sql("SELECT customer_id, first_name FROM customer", connection)
payment_df = pd.read_sql("SELECT customer_id, amount FROM payment", connection)
 
# Sujungimas ir sumos apskaičiavimas
merged = pd.merge(customers_df, payment_df, on="customer_id", how="inner")
grouped = merged.groupby(["customer_id", "first_name"])["amount"].sum().reset_index()
 
# Naujos lentelės sukūrimas
cursor = connection.cursor()
create_table_query = """
CREATE TABLE IF NOT EXISTS klientu_mokejimai (
    customer_id INT,
    first_name VARCHAR(255),
    amount DECIMAL(10,2)
)
"""
cursor.execute(create_table_query)
 
# Įrašų įterpimas
for _, row in grouped.iterrows():
    insert_query = """
    INSERT INTO klientu_mokejimai (customer_id, first_name, amount)
    VALUES (%s, %s, %s)
    """
    cursor.execute(insert_query, (row["customer_id"], row["first_name"], row["amount"]))
 
# Įrašų išsaugojimas
connection.commit()
cursor.close()
connection.close()

C:\Users\donat\AppData\Local\Temp\ipykernel_20084\514926406.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customers_df = pd.read_sql("SELECT customer_id, first_name FROM customer", connection)
C:\Users\donat\AppData\Local\Temp\ipykernel_20084\514926406.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  payment_df = pd.read_sql("SELECT customer_id, amount FROM payment", connection)